BFBR2/BFBR2AtomsBiomass_50g_3Umf_restart/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.045 -0.045 -0.02)
    (0.045 -0.045 -0.02)
    (0.045  0.045 -0.02)
    (-0.045  0.045 -0.02)
    (-0.045 -0.045 0.45)
    (0.045 -0.045 0.45)
    (0.045  0.045 0.45)
    (-0.045  0.045 0.45)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (10 10 40) simpleGrading (1 1 1)
	hex (0 1 2 3 4 5 6 7) (10 10 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
