BFBR2/BFBR2AtomsBiomass_50g_3Umf_restart/CFD/constant/liggghtsCommands_restart
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          liggghtsCommands;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

liggghtsCommandModels
(
    runLiggghts
);

/*runLiggghtsProps
{
    preNo false;
}
*/

//- optional
//writeLiggghtsProps
//{
//    writeLast off;
//    writeName "post/restart/liggghts.restartCFDEM";
//    overwrite on;
//}

// ************************************************************************* //
